Catalogs/КойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КойкоМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Палаты</xr:Item>
			</Owners>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КойкоМеста/Forms/ФормаПеремещенияКоек/Ext/Form/Module.bsl
&НаКлиенте
Перем мСтандартныеНаименованияКоек;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановкаСостояния = Параметры.Свойство("УстановкаСостояния");
	ПеремещениеКоек = Параметры.Свойство("ПеремещениеКоек");
	
	ИзменитьПалату = Не УстановкаСостояния;
	Элементы.ИзменитьПалату.Видимость = Не(ПеремещениеКоек Или УстановкаСостояния);
	Элементы.Палата.Видимость = ИзменитьПалату;
	Элементы.Статус.Видимость = Не ИзменитьПалату; 
	
	Если Параметры.Свойство("Палата") Тогда 
		ПалатаПоУмолчанию = Параметры.Палата; 
	КонецЕсли;
	СтатусПоУмолчанию = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаПеремещенияКоек", "ПоследнийСтатус"); 
	
	Если ИзменитьПалату Тогда
		Палата = ПалатаПоУмолчанию;		
	Иначе
		Статус = СтатусПоУмолчанию;
	КонецЕсли;
	
	Если Параметры.Свойство("Койки") Тогда
		ЗанятыеКойки = РегистрыСведений.СостояниеКойкоМеста.ПолучитьЗанятыеКойки(ТекущаяДата());
		УдаленныеКойки = Новый Массив;
		Для Каждого Койка Из Параметры.Койки Цикл
			Если ЗанятыеКойки.Найти(Койка) = Неопределено Тогда
				НоваяСтрока = СписокКоек.Добавить();
				НоваяСтрока.Койка = Койка;
				НоваяСтрока.Палата = Койка.Владелец;
				НоваяСтрока.Представление = Койка.Наименование;
				НоваяСтрока.ПалатаПрефикс = Койка.Владелец.Префикс;
			Иначе
				УдаленныеКойки.Добавить(Койка);		
			КонецЕсли;
		КонецЦикла;
		
		Если УдаленныеКойки.Количество() > 0 Тогда
			ТекстСообщения = "Следующие койки заняты и не могут быть перемещены:";
			Для Каждого Койка Из УдаленныеКойки Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Койка;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ, СтандартнаяОбработка)
	
	Если СписокКоек.Количество() = 0 Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	
	мСтандартныеНаименованияКоек = ПолучитьСтандартныеНаименованияКоек();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереместитьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ПереместитьНаСервере(ПолучитьКойки(), Палата, Статус, Комментарий, Отказ);
	Если Не ИзменитьПалату Тогда
		РаботаСФормамиСервер.СохранитьНастройкуФормы("ФормаПеремещенияКоек", "ПоследнийСтатус", Статус);
	КонецЕсли;
	Если Не Отказ Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПредставление(Команда)
	
	Для Каждого Строка Из СписокКоек Цикл
		Строка.Представление = "";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИзменитьПалатуПриИзменении(Элемент)
	
	Элементы.Палата.Видимость = ИзменитьПалату;
	Элементы.Статус.Видимость = Не ИзменитьПалату;
	
	Если ИзменитьПалату Тогда
		Палата = ПалатаПоУмолчанию;
		Статус = Неопределено;
	Иначе
		Палата = Неопределено;
		Статус = СтатусПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКоекПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ПрефиксПалаты = ?(ЗначениеЗаполнено(Палата),ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(Палата, "Префикс"), "");
	
	Для Каждого Наименование из мСтандартныеНаименованияКоек Цикл
		ПрефиксПалаты = ?(ПрефиксПалаты = "", Элементы.СписокКоек.ТекущиеДанные.ПалатаПрефикс, ПрефиксПалаты);
		ДанныеВыбора.Добавить(ПрефиксПалаты + " " + Наименование);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Функция ПолучитьКойки()
	
	МассивКоек = Новый Массив;
	
	КойкаПредставление = Новый Соответствие;
		
	Для Каждого Строка Из СписокКоек Цикл
		МассивКоек.Добавить(Строка.Койка);
		КойкаПредставление.Вставить(Строка.Койка, Строка.Представление);
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("Значения", МассивКоек);
	СтруктураВозврата.Вставить("ЗначенияИПредставления", КойкаПредставление);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПереместитьНаСервере(Койки, Палата, Статус, Комментарий, Отказ = Ложь)
	
	ОшибочныеКойки = РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(Койки.Значения, Палата, Статус, Комментарий);
	ПереименоватьКойки(Койки.ЗначенияИПредставления, ОшибочныеКойки);
	
	Если ОшибочныеКойки.Количество() > 0 Тогда
		Отказ = Истина;
		ТекстОшибки = "Перемещено " + Строка(Койки.Значения.Количество() - ОшибочныеКойки.Количество()) + " коек.
			|Следующие койки заняты и не могут быть перемещены:";
			
		Для Каждого Койка Из ОшибочныеКойки Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС + Койка;		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереименоватьКойки(КойкаПредставление, ОшибочныеКойки)
	
	Для Каждого КлючИЗначение Из КойкаПредставление Цикл 
		Если ОшибочныеКойки.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			Объект = КлючИЗначение.Ключ.ПолучитьОбъект();
			Объект.Наименование = КлючИЗначение.Значение;
			Объект.Записать();
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтандартныеНаименованияКоек()
	
	Возврат Справочники.КойкоМеста.ПолучитьСтандартныеНаименованияКоек();
		
КонецФункции

#КонецОбласти
